[{"id": "depth-estimation", "name": "Depth estimation", "description": "Depth estimation is the task of predicting depth of the objects present in an image."}, {"id": "image-classification", "name": "Image classification", "description": "Image classification is the task of assigning a label or class to an entire image. Images are expected to have only one class for each image. Image classification models take an image as input and return a prediction about which class the image belongs to."}, {"id": "image-segmentation", "name": "Image segmentation", "description": "Image Segmentation divides an image into segments where each pixel in the image is mapped to an object. This task has multiple variants such as instance segmentation, panoptic segmentation and semantic segmentation."}, {"id": "image-to-image", "name": "Image to image", "description": "Image-to-image is the task of transforming a source image to match the characteristics of a target image or a target image domain. Any image manipulation and enhancement is possible with image to image models."}, {"id": "object-detection", "name": "Object detection", "description": "Object Detection models allow users to identify objects of certain defined classes. Object detection models receive an image as input and output the images with bounding boxes and labels on detected objects."}, {"id": "video-classification", "name": "Video classification", "description": "Video classification is the task of assigning a label or class to an entire video. Videos are expected to have only one class for each video. Video classification models take a video as input and return a prediction about which class the video belongs to."}, {"id": "unconditional-image-generation", "name": "Unconditional image generation", "description": "Unconditional image generation is the task of generating images with no condition in any context (like a prompt text or another image). Once trained, the model will create images that resemble its training data distribution."}, {"id": "zero-shot-image-classification", "name": "Zero shot image classification", "description": "Zero shot image classification is the task of classifying previously unseen classes during training of a model."}, {"id": "conversational", "name": "Conversational", "description": "Conversational response modelling is the task of generating conversational text that is relevant, coherent and knowledgable given a prompt. These models have applications in chatbots, and as a part of voice assistants"}, {"id": "fill-mask", "name": "Fill mask", "description": "Masked language modeling is the task of masking some of the words in a sentence and predicting which words should replace those masks. These models are useful when we want to get a statistical understanding of the language in which the model is trained in."}, {"id": "question-answering", "name": "Question answering", "description": "Question Answering models can retrieve the answer to a question from a given text, which is useful for searching for an answer in a document. Some question answering models can generate answers without context!"}, {"id": "sentence-similarity", "name": "Sentence similarity", "description": "Sentence Similarity is the task of determining how similar two texts are. Sentence similarity models convert input texts into vectors (embeddings) that capture semantic information and calculate how close (similar) they are between them. This task is particularly useful for information retrieval and clustering/grouping."}, {"id": "summarization", "name": "Summarization", "description": "Summarization is the task of producing a shorter version of a document while preserving its important information. Some models can extract text from the original input, while other models can generate entirely new text."}, {"id": "table-question-answering", "name": "Table question answering", "description": "Table Question Answering (Table QA) is the answering a question about an information on a given table."}, {"id": "text-classification", "name": "Text classification", "description": "Text Classification is the task of assigning a label or class to a given text. Some use cases are sentiment analysis, natural language inference, and assessing grammatical correctness."}, {"id": "text-generation", "name": "Text generation", "description": "Generating text is the task of producing new text. These models can, for example, fill in incomplete text or paraphrase."}, {"id": "token-classification", "name": "Token classification", "description": "Token classification is a natural language understanding task in which a label is assigned to some tokens in a text. Some popular token classification subtasks are Named Entity Recognition (NER) and Part-of-Speech (PoS) tagging. NER models could be trained to identify specific entities in a text, such as dates, individuals and places; and PoS tagging would identify, for example, which words in a text are verbs, nouns, and punctuation marks."}, {"id": "translation", "name": "Translation", "description": "Translation is the task of converting text from one language to another."}, {"id": "zero-shot-classification", "name": "Zero shot classification", "description": "Zero-shot text classification is a task in natural language processing where a model is trained on a set of labeled examples but is then able to classify new examples from previously unseen classes."}, {"id": "audio-classification", "name": "Audio classification", "description": "Audio classification is the task of assigning a label or class to a given audio. It can be used for recognizing which command a user is giving or the emotion of a statement, as well as identifying a speaker."}, {"id": "audio-to-audio", "name": "Audio to audio", "description": "Audio-to-Audio is a family of tasks in which the input is an audio and the output is one or multiple generated audios. Some example tasks are speech enhancement and source separation."}, {"id": "automatic-speech-recognition", "name": "Automatic speech recognition", "description": "Automatic Speech Recognition (ASR), also known as Speech to Text (STT), is the task of transcribing a given audio to text. It has many applications, such as voice user interfaces."}, {"id": "text-to-speech", "name": "Text to speech", "description": "Text-to-Speech (TTS) is the task of generating natural sounding speech given text input. TTS models can be extended to have a single model that generates speech for multiple speakers and multiple languages."}, {"id": "tabular-classification", "name": "Tabular classification", "description": "Tabular classification is the task of classifying a target category (a group) based on set of attributes."}, {"id": "tabular-regression", "name": "Tabular regression", "description": "Tabular regression is the task of predicting a numerical value given a set of attributes."}, {"id": "document-question-answering", "name": "Document question answering", "description": "Document Question Answering (also known as Document Visual Question Answering) is the task of answering questions on document images. Document question answering models take a (document, question) pair as input and return an answer in natural language. Models usually rely on multi-modal features, combining text, position of words (bounding-boxes) and image."}, {"id": "feature-extraction", "name": "Feature extraction", "description": "Feature extraction refers to the process of transforming raw data into numerical features that can be processed while preserving the information in the original dataset."}, {"id": "image-to-text", "name": "Image to text", "description": "Image to text models output a text from a given image. Image captioning or optical character recognition can be considered as the most common applications of image to text."}, {"id": "text-to-image", "name": "Text to image", "description": "Generates images from input text. These models can be used to generate and modify images based on text prompts."}, {"id": "text-to-video", "name": "Text to video", "description": "Generates videos from input text."}, {"id": "visual-question-answering", "name": "Visual question answering", "description": "Visual Question Answering is the task of answering open-ended questions based on an image. They output natural language responses to natural language questions."}, {"id": "reinforcement-learning", "name": "Reinforcement learning", "description": "Reinforcement learning is the computational approach of learning from action by interacting with an environment through trial and error and receiving rewards (negative or positive) as feedback"}]